In [ ]:
import pandas as pd

### Archivos en Pandas

In [ ]:
# Creamos un DataFrame
datos={  "Nombre" : ['Marcia','Marcos','Luis','Tatiana','Pedro'],
         "Sexo"   : ['Femennino','Masculino','Masculino','Femenino','Masculino'],
         "Edad"   : [23,13,43,17,23],
         "Ciudad" : ['Huancayo','Lima','Trujillo','Arequipa','Ica']}
df=pd.DataFrame(datos)
df

    Nombre       Sexo  Edad    Ciudad
0   Marcia  Femennino    23  Huancayo
1   Marcos  Masculino    13      Lima
2     Luis  Masculino    43  Trujillo
3  Tatiana   Femenino    17  Arequipa
4    Pedro  Masculino    23       Ica

###Exportamos el DataFrame a un archivo de tipo .csv
* Primero debemos ubicar una carpeta donde guardar el archivo
* Activamos el googleDrive o enlazamo en el colab
* Primero vamos a la barra izquieda  y hacemos clik en Archivos
* Activar Drive
* Localizar la carpeta en Drive -> MyDrive ->ColabNotebook->dbase
* Hacer clik en tres puntos y copiar la ruta
* Lugo copia la tuta y agrega el nombre del archivo y su extension 

df.to_csv('/content/drive/MyDrive/Colab Notebooks/dbase/persona.csv')

* se ha granado el archivo persona.csv en la carpeta dbase. Verificar

In [ ]:
 
df.to_csv('/content/drive/MyDrive/Colab Notebooks/dbase/persona.csv')

###Importamos en DataFrame desde un archivo de tipo .csv
* Copiamos la ruta del archivo, que se encuentra en la carpeta dbase , estando en Mydrive -> dbase -> archivo, clik en los tres puntos y copiar la ruta.

In [ ]:
df2=pd.read_csv('/content/drive/MyDrive/Colab Notebooks/dbase/persona.csv')
df2

   Unnamed: 0   Nombre       Sexo  Edad    Ciudad
0           0   Marcia  Femennino    23  Huancayo
1           1   Marcos  Masculino    13      Lima
2           2     Luis  Masculino    43  Trujillo
3           3  Tatiana   Femenino    17  Arequipa
4           4    Pedro  Masculino    23       Ica

In [ ]:
# Guardando el archivo con separados '|'

df.to_csv('/content/drive/MyDrive/Colab Notebooks/dbase/persona.csv',sep='|')

In [ ]:
# Argumento separador de datos
df2=pd.read_csv('/content/drive/MyDrive/Colab Notebooks/dbase/persona.csv',sep='|')
df2

   Unnamed: 0   Nombre       Sexo  Edad    Ciudad
0           0   Marcia  Femennino    23  Huancayo
1           1   Marcos  Masculino    13      Lima
2           2     Luis  Masculino    43  Trujillo
3           3  Tatiana   Femenino    17  Arequipa
4           4    Pedro  Masculino    23       Ica

In [ ]:
# Eliminamos la columna de indice
df2=pd.read_csv('/content/drive/MyDrive/Colab Notebooks/dbase/persona.csv',sep='|',index_col=0)
df2

    Nombre       Sexo  Edad    Ciudad
0   Marcia  Femennino    23  Huancayo
1   Marcos  Masculino    13      Lima
2     Luis  Masculino    43  Trujillo
3  Tatiana   Femenino    17  Arequipa
4    Pedro  Masculino    23       Ica

In [ ]:
# Asignado NaN a algunos valores de la DataFrame
df2=pd.read_csv('/content/drive/MyDrive/Colab Notebooks/dbase/persona.csv',sep='|',index_col=0,na_values=[43])
df2

    Nombre       Sexo  Edad    Ciudad
0   Marcia  Femennino  23.0  Huancayo
1   Marcos  Masculino  13.0      Lima
2     Luis  Masculino   NaN  Trujillo
3  Tatiana   Femenino  17.0  Arequipa
4    Pedro  Masculino  23.0       Ica

In [ ]:
# Argumento separador de datos
df2=pd.read_csv('/content/drive/MyDrive/Colab Notebooks/dbase/persona.csv',sep='|',index_col=0,decimal=',')
df2

    Nombre       Sexo  Edad    Ciudad
0   Marcia  Femennino    23  Huancayo
1   Marcos  Masculino    13      Lima
2     Luis  Masculino    43  Trujillo
3  Tatiana   Femenino    17  Arequipa
4    Pedro  Masculino    23       Ica

In [ ]:
# Argumento hader que especifica una lista de filas
df2=pd.read_csv('/content/drive/MyDrive/Colab Notebooks/dbase/persona.csv',sep='|',index_col=0,header=[0,1,2])
df2

    Nombre       Sexo Edad    Ciudad
0   Marcia  Femennino   23  Huancayo
1   Marcos  Masculino   13      Lima
2     Luis  Masculino   43  Trujillo
3  Tatiana   Femenino   17  Arequipa
4    Pedro  Masculino   23       Ica

In [ ]:
# Argumento usecols selecciona la que especifica una lista de columnas
df2=pd.read_csv('/content/drive/MyDrive/Colab Notebooks/dbase/persona.csv',sep='|',index_col=0,usecols=['Nombre','Sexo'])
df2

              Sexo
Nombre
Marcia   Femennino
Marcos   Masculino
Luis     Masculino
Tatiana   Femenino
Pedro    Masculino

In [ ]:
# Exportamos el DataFrame a un archivo de tipo .excel
df.to_excel('/content/drive/MyDrive/Colab Notebooks/dbase/persona.excel')

In [ ]:
# Importamos en DataFrame desde un archivo de tipo .xlsx
df3=pd.read_excel('/content/drive/MyDrive/Colab Notebooks/dbase/persona.xlsx',index_col=0)
df3

    Nombre       Sexo  Edad    Ciudad
0   Marcia  Femennino    23  Huancayo
1   Marcos  Masculino    13      Lima
2     Luis  Masculino    43  Trujillo
3  Tatiana   Femenino    17  Arequipa
4    Pedro  Masculino    23       Ica

In [ ]:
# Exportamos el DataFrame a un archivo de tipo .json
df.to_json('/content/drive/MyDrive/Colab Notebooks/dbase/persona.json')

In [ ]:
# Importamos en DataFrame desde un archivo de tipo .json
df4=pd.read_json('/content/drive/MyDrive/Colab Notebooks/dbase/persona.json')
df4

    Nombre       Sexo  Edad    Ciudad
0   Marcia  Femennino    23  Huancayo
1   Marcos  Masculino    13      Lima
2     Luis  Masculino    43  Trujillo
3  Tatiana   Femenino    17  Arequipa
4    Pedro  Masculino    23       Ica

In [ ]:
# Exportamos el DataFrame a un archivo de tipo .Pickle
df.to_pickle('/content/drive/MyDrive/Colab Notebooks/dbase/persona.pkl')

In [ ]:
# Importamos en DataFrame desde un archivo de tipo .json
df4=pd.read_pickle('/content/drive/MyDrive/Colab Notebooks/dbase/persona.pkl')
df4

    Nombre       Sexo  Edad    Ciudad
0   Marcia  Femennino    23  Huancayo
1   Marcos  Masculino    13      Lima
2     Luis  Masculino    43  Trujillo
3  Tatiana   Femenino    17  Arequipa
4    Pedro  Masculino    23       Ica

In [ ]:
# Exportamos el DataFrame a un archivo de tipo .Parquet
df.to_parquet('/content/drive/MyDrive/Colab Notebooks/dbase/persona.parquet')

In [ ]:
# Importamos en DataFrame desde un archivo de tipo .json
df4=pd.read_parquet('/content/drive/MyDrive/Colab Notebooks/dbase/persona.parquet')
df4

    Nombre       Sexo  Edad    Ciudad
0   Marcia  Femennino    23  Huancayo
1   Marcos  Masculino    13      Lima
2     Luis  Masculino    43  Trujillo
3  Tatiana   Femenino    17  Arequipa
4    Pedro  Masculino    23       Ica

In [ ]:
# Import pandas desde un url
df2=pd.read_csv('/content/drive/MyDrive/Colab Notebooks/dbase/meteorite-landings.csv')
df2

             name     id  ...    reclong               GeoLocation
0          Aachen      1  ...    6.08333     (50.775000, 6.083330)
1          Aarhus      2  ...   10.23333    (56.183330, 10.233330)
2            Abee      6  ... -113.00000  (54.216670, -113.000000)
3        Acapulco     10  ...  -99.90000   (16.883330, -99.900000)
4         Achiras    370  ...  -64.95000  (-33.166670, -64.950000)
...           ...    ...  ...        ...                       ...
45711  Zillah 002  31356  ...   17.01850    (29.037000, 17.018500)
45712      Zinder  30409  ...    8.96667     (13.783330, 8.966670)
45713        Zlin  30410  ...   17.66667    (49.250000, 17.666670)
45714   Zubkovsky  31357  ...   41.50460    (49.789170, 41.504600)
45715  Zulu Queen  30414  ... -115.68333  (33.983330, -115.683330)

[45716 rows x 10 columns]

In [ ]:
# Despliega las 5 primeras filas
df2.head()

       name   id nametype  ...    reclat    reclong               GeoLocation
0    Aachen    1    Valid  ...  50.77500    6.08333     (50.775000, 6.083330)
1    Aarhus    2    Valid  ...  56.18333   10.23333    (56.183330, 10.233330)
2      Abee    6    Valid  ...  54.21667 -113.00000  (54.216670, -113.000000)
3  Acapulco   10    Valid  ...  16.88333  -99.90000   (16.883330, -99.900000)
4   Achiras  370    Valid  ... -33.16667  -64.95000  (-33.166670, -64.950000)

[5 rows x 10 columns]

In [ ]:
# Despliega las 6 primeras filas
df2.head(6)

       name   id nametype  ...    reclat    reclong               GeoLocation
0    Aachen    1    Valid  ...  50.77500    6.08333     (50.775000, 6.083330)
1    Aarhus    2    Valid  ...  56.18333   10.23333    (56.183330, 10.233330)
2      Abee    6    Valid  ...  54.21667 -113.00000  (54.216670, -113.000000)
3  Acapulco   10    Valid  ...  16.88333  -99.90000   (16.883330, -99.900000)
4   Achiras  370    Valid  ... -33.16667  -64.95000  (-33.166670, -64.950000)
5  Adhi Kot  379    Valid  ...  32.10000   71.80000    (32.100000, 71.800000)

[6 rows x 10 columns]

In [ ]:
#despliega 5 filas aleatoriamente
df2.sample(5)

                        name     id  ...    reclong               GeoLocation
30443  Northwest Africa 7375  55732  ...    0.00000      (0.000000, 0.000000)
42134          Yamato 793491  28840  ...   35.66667   (-71.500000, 35.666670)
41874          Yamato 793228  28577  ...   35.66667   (-71.500000, 35.666670)
1875       Allan Hills 84088    690  ...  156.92287  (-76.902250, 156.922870)
722                    Ohaba  17995  ...   23.58333    (46.066670, 23.583330)

[5 rows x 10 columns]

In [ ]:
# despliaga las ultimas 5 filas
df2.tail()

             name     id  ...    reclong               GeoLocation
45711  Zillah 002  31356  ...   17.01850    (29.037000, 17.018500)
45712      Zinder  30409  ...    8.96667     (13.783330, 8.966670)
45713        Zlin  30410  ...   17.66667    (49.250000, 17.666670)
45714   Zubkovsky  31357  ...   41.50460    (49.789170, 41.504600)
45715  Zulu Queen  30414  ... -115.68333  (33.983330, -115.683330)

[5 rows x 10 columns]

In [ ]:
# Describe los datos 
df2.describe()

                 id          mass          year        reclat       reclong
count  45716.000000  4.558500e+04  45428.000000  38401.000000  38401.000000
mean   26889.735104  1.327808e+04   1991.772189    -39.122580     61.074319
std    16860.683030  5.749889e+05     27.181247     46.378511     80.647298
min        1.000000  0.000000e+00    301.000000    -87.366670   -165.433330
25%    12688.750000  7.200000e+00   1987.000000    -76.714240      0.000000
50%    24261.500000  3.260000e+01   1998.000000    -71.500000     35.666670
75%    40656.750000  2.026000e+02   2003.000000      0.000000    157.166670
max    57458.000000  6.000000e+07   2501.000000     81.166670    354.473330

In [ ]:
# describe considerando tods las variable
df2.describe(include='all')

                name            id  ...       reclong           GeoLocation
count          45716  45716.000000  ...  38401.000000                 38401
unique         45716           NaN  ...           NaN                 17100
top     Asuka 880948           NaN  ...           NaN  (0.000000, 0.000000)
freq               1           NaN  ...           NaN                  6214
mean             NaN  26889.735104  ...     61.074319                   NaN
std              NaN  16860.683030  ...     80.647298                   NaN
min              NaN      1.000000  ...   -165.433330                   NaN
25%              NaN  12688.750000  ...      0.000000                   NaN
50%              NaN  24261.500000  ...     35.666670                   NaN
75%              NaN  40656.750000  ...    157.166670                   NaN
max              NaN  57458.000000  ...    354.473330                   NaN

[11 rows x 10 columns]

In [ ]:
# Devuelve la informacion sobre el data frame
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.5+ MB

In [ ]:
# Devuelve la cantidad
df2.shape

(45716, 10)

In [ ]:
# el tamano de registros
df2.size

457160

In [ ]:
# Devuelve las columnas
df2.columns

Index(['name', 'id', 'nametype', 'recclass', 'mass', 'fall', 'year', 'reclat',
       'reclong', 'GeoLocation'],
      dtype='object')

In [ ]:
# devuelve los tipos
df2.dtypes

name            object
id               int64
nametype        object
recclass        object
mass           float64
fall            object
year           float64
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

In [ ]:
# Renombrar los nombres de las filas y columnas
print(df2.reindex(index=[1,2,3,4],columns=['name','id']))

       name   id
1    Aarhus    2
2      Abee    6
3  Acapulco   10
4   Achiras  370